#ifndef define_H_
#define define_H_
//******************************************************************************
//  Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <mega128.h>
//******************************************************************************
//  Секция определения глобальных переменных
//******************************************************************************


//******************************************************************************
//  Секция прототипов функций
//******************************************************************************

//******************************************************************************
//  Секция определения макросов
//******************************************************************************


#define bit_test(reg, bit_no)   ( (reg) & (1 << (bit_no))) 

//--------------управление битами---------------
#define ClearBit(reg, bit)       reg &= (~(1<<(bit)))
#define SetBit(reg, bit)          reg |= (1<<(bit))

#define   InvBit(reg, bit)          reg ^= (1<<bit)
#define   BitIsSet(reg, bit)       ((reg & (1<<bit)) != 0)
#define   BitIsClear(reg, bit)    ((reg & (1<<bit)) == 0)


//if  (BitIsClear(PIND, 0)) {   //если очищен нулевой бит в регистре PIND                                    
//…..                                     //выполнить блок
//}
//----------------------Управление------------------------------------------------
#define AMPLIFIER_ON      SetBit(PORTF,5);  
#define AMPLIFIER_OFF     ClearBit(PORTF,5);
#define AMPLIFIER_PIN_OFF BitIsClear(PORTF,5) //Проверка выключен ли усилитель (считываем из порта F и проверяем бит 5)

//----------------------------------------------------------------------
#define ON 1
#define OFF 2

#define LOCK    0
#define UNLOCK  1

#define START 2
#define STOP 3

#define ERROR 0
#define NORM  1

#define COMPLETED 1
#define PAUSE 0


#define QUARTZ_10MHZ 1
#define QUARTZ_12MHZ 2 

#define WORK_MODE 1
#define SETTING_MODE 2
#define LCD_MESEGER 3
#define DEBUG_MODE 4
//---------------------------------Деление на 256--------------------------------------------------------
#define LONG_VALUE_DIV256(var) ((*(volatile unsigned int long *)((unsigned int)&(var) + 1)) & 0x00FFFFFF)

#endif /* define_H_ */

//******************************************************************************
//  ENF OF FILE
//******************************************************************************